#include <Items.h>
//                                                                                       | O_LEFT  | O_SZ   | O_HR   | O_RW                                                           //коментарий
const TItem Items[MAX_ITEMS] = {
//№ группы     Текст в строке 0         Текст в строке 1    Сокр.коментарий   Ед.измер  Опиции                                Тип/ФорматУр.доступа  Маска   Ном.группы/адрес ре//
//                                                                                         вырав    нули    тип рег  запись                                                    //
                                                                                                                                                                               //
     0   ,       " Измерение"        ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0xFF   ,        1         ,//  1
     1   ,"Ускорение"                ,         ""          ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0xff   ,        16        ,//  2
     1   ,"Скорость"                 ,         ""          ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0xff   ,        16        ,//  3
     1   ,"Перемещение"              ,         ""          ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0xff   ,        16        ,//  4
     1   ,"Выборка сигнала"          ,         ""          ,""              ,""        ,0          | O_SZ            | O_RW  ,   131   ,    1    ,  0xff   ,        16        ,//  5
     0   ,   " Частотный диапазон"   ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0x87   ,        2         ,//  6
     2   ," 5-1000  Гц"              ,     "5-1000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0x81   ,        17        ,//  7  параметр для канала виброускорения
     2   ,"10-1000  Гц"              ,    "10-1000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0x81   ,        17        ,//  8  параметр для канала виброускорения
     2   ,"10-2000  Гц"              ,    "10-2000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0x81   ,        17        ,//  9  параметр для канала виброускорения
     2   ,"10-5000  Гц"              ,    "10-5000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   131   ,    1    ,  0x81   ,        17        ,// 10  параметр для канала виброускорения
//   2   ,"10-10000 Гц"              ,    "10-10000 Гц"    ,""              ,""        ,0          | O_SZ            | O_RW  ,   132   ,    1    ,  0x81   ,        17        ,// 11  параметр для канала виброускорения
     2   ," 5-1000  Гц"              ,     "5-1000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0x82   ,        18        ,// 12  параметр для канала виброскорости
     2   ,"10-1000  Гц"              ,    "10-1000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0x82   ,        18        ,// 13  параметр для канала виброскорости
     2   ,"10-2000  Гц"              ,    "10-2000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0x82   ,        18        ,// 14  параметр для канала виброскорости
     2   ,"10-5000  Гц"              ,    "10-5000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   131   ,    1    ,  0x82   ,        18        ,// 15  параметр для канала виброскорости
     2   ,"10-300  Гц"               ,     "10-300 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0x84   ,        19        ,// 16  параметр для канала виброперемещение
     0   ,     " Режим/Детектор"     ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0x87   ,        3         ,// 17
     3   ,"СКЗ"                      ,        "скз"        ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0x81   ,        20        ,// 18  параметр для канала виброускорения
     3   ,"ПИК"                      ,        "пик"        ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0x81   ,        20        ,// 19  параметр для канала виброускорения
     3   ,"ПИК-ПИК"                  ,      "пик-пик"      ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0x81   ,        20        ,// 20  параметр для канала виброускорения
     3   ,"ПИК-Фактор"               ,    "пик-фактор"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   131   ,    1    ,  0x81   ,        20        ,// 21  параметр для канала виброускорения
//   3   ,"Спектр"                   ,      "спектр"       ,""              ,""        ,0          | O_SZ            | O_RW  ,   132   ,    1    ,  0x81   ,        20        ,// 22  параметр для канала виброускорения
     3   ,"СКЗ"                      ,        "скз"        ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0x82   ,        21        ,// 23  параметр для канала виброскорости
     3   ,"ПИК"                      ,        "пик"        ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0x82   ,        21        ,// 24  параметр для канала виброскорости
     3   ,"ПИК-ПИК"                  ,      "пик-пик"      ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0x82   ,        21        ,// 25  параметр для канала виброскорости
     3   ,"ПИК-Фактор"               ,    "пик-фактор"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   131   ,    1    ,  0x82   ,        21        ,// 26  параметр для канала виброскорости
//   3   ,"Спектр"                   ,      "спектр"       ,""              ,""        ,0          | O_SZ            | O_RW  ,   132   ,    1    ,  0x82   ,        21        ,// 27  параметр для канала виброскорости
     3   ,"ПИК"                      ,        "пик"        ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0x84   ,        22        ,// 28  параметр для канала виброперемещение
     3   ,"ПИК-ПИК"                  ,      "пик-пик"      ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0x84   ,        22        ,// 29  параметр для канала виброперемещение
     0   ,         " Сервис"         ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0xff   ,        4         ,// 30
     4   ,"Текущее время"            ,      "час:мин"      ,"Время"         ,""        ,0                            | O_RW  ,   18    ,    1    ,  0xff   ,        2         ,// 31
     4   ,"Текущая дата"             ,      "чис:мес"      ,"Дата"          ,""        ,0                            | O_RW  ,   19    ,    1    ,  0xff   ,        1         ,// 32
     4   ,"ТекущиЙ год"              ,         ""          ,"Год"           ,""        ,0                            | O_RW  ,    0    ,    1    ,  0xff   ,        0         ,// 33
     4   ,"Коррекция"                ,  "виброускорения"   ,"Коррекция"     ,""        ,0          | O_SZ            | O_RW  ,    3    ,    1    ,  0x80   ,        25        ,// 34
     4   ,"Номер датчика"            ,  "DV-2"   					 ,"Номер DV"    ,""        ,0          | O_SZ            | O_RW  ,    0    ,    1    ,  0x80   ,        23        ,// 34
     4   ,"Номер датчика"            ,  "DV-2"   					 ,"Номер DV"    ,""        ,0                      						   ,    0    ,    1    ,  0x7F   ,        23        ,// 34		 
     4   ,"Версия программного"      ,    "обеспечения"    ,"Версия ПО"     ,""        ,0                                    ,    2    ,    1    ,  0xff   ,        13        ,// 35
     4   ,"Форматировать"            ,         ""          ,""              ,""        ,0                            | O_RW  ,   10    ,    1    ,  0xff   ,        1         ,// 36
     4   ,"Наработка прибора"        ,         ""          ,"Наработка"     ," час"    ,0                                    ,    0    ,    1    ,  0xff   ,        14        ,// 37
     0   ," Выбор маршрута"          ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0x78   ,        5         ,// 30
		 5   ,"Маршрут"         				 ,         ""          ,       ""       ,    ""    ,0                                    ,  130   ,    0    ,  0xff   ,        0xff         ,// 30
};
const TEnum_val Enum_val[COUNT_ENUM] = {
//№ группы         Значение                Расшифровка
    25   ,                          0,"разомк"             ,//               1
    25   ,                          1,"замк"               ,//               2
    26   ,                          0,"Откл"               ,//               3
    26   ,                          1,"Вкл"                ,//               4
};
