#include <Items.h>
//                                                                                       | O_LEFT  | O_SZ   | O_HR   | O_RW                                                           //коментарий
const TItem Items[MAX_ITEMS] = {
//№ группы     Текст в строке 0         Текст в строке 1    Сокр.коментарий   Ед.измер  Опиции                                Тип/ФорматУр.доступа  Маска   Ном.группы/адрес ре//
//                                                                                         вырав    нули    тип рег  запись                                                    //
                                                                                                                                                                               //
     0   ,       " Измерение"        ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0xFF   ,        1         ,//  0
     1   ,"Ускорение"                ,         ""          ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0xff   ,        16        ,//  1
     1   ,"Скорость"                 ,         ""          ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0xff   ,        16        ,//  2
     1   ,"Перемещение"              ,         ""          ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0xff   ,        16        ,//  3
     1   ,"Выборка сигнала"          ,         ""          ,""              ,""        ,0          | O_SZ            | O_RW  ,   131   ,    1    ,  0xff   ,        16        ,//  4
     1   ,   " Частотный диапазон"   ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0x87   ,        2         ,//  5
     2   ," 5-1000  Гц"              ,     "5-1000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0x81   ,        17        ,//  6  параметр для канала виброускорения
     2   ,"10-1000  Гц"              ,    "10-1000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0x81   ,        17        ,//  7  параметр для канала виброускорения
     2   ,"10-2000  Гц"              ,    "10-2000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0x81   ,        17        ,//  8  параметр для канала виброускорения
     2   ,"10-5000  Гц"              ,    "10-5000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   131   ,    1    ,  0x81   ,        17        ,// 9  параметр для канала виброускорения
//   2   ,"10-10000 Гц"              ,    "10-10000 Гц"    ,""              ,""        ,0          | O_SZ            | O_RW  ,   132   ,    1    ,  0x81   ,        17        ,// 10  параметр для канала виброускорения
     2   ," 5-1000  Гц"              ,     "5-1000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0x82   ,        18        ,// 10  параметр для канала виброскорости
     2   ,"10-1000  Гц"              ,    "10-1000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0x82   ,        18        ,// 11  параметр для канала виброскорости
     2   ,"10-2000  Гц"              ,    "10-2000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0x82   ,        18        ,// 12  параметр для канала виброскорости
     2   ,"10-5000  Гц"              ,    "10-5000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   131   ,    1    ,  0x82   ,        18        ,// 13  параметр для канала виброскорости
     2   ,"10-300  Гц"               ,     "10-300 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0x84   ,        19        ,// 14  параметр для канала виброперемещение
     1   ,     " Режим/Детектор"     ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0x87   ,        3         ,// 15
     3   ,"СКЗ"                      ,        "скз"        ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0x81   ,        20        ,// 16  параметр для канала виброускорения
     3   ,"ПИК"                      ,        "пик"        ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0x81   ,        20        ,// 17  параметр для канала виброускорения
     3   ,"ПИК-ПИК"                  ,      "пик-пик"      ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0x81   ,        20        ,// 18  параметр для канала виброускорения
     3   ,"ПИК-Фактор"               ,    "пик-фактор"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   131   ,    1    ,  0x81   ,        20        ,// 19  параметр для канала виброускорения
//   3   ,"Спектр"                   ,      "спектр"       ,""              ,""        ,0          | O_SZ            | O_RW  ,   132   ,    1    ,  0x81   ,        20        ,// 20  параметр для канала виброускорения
     3   ,"СКЗ"                      ,        "скз"        ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0x82   ,        21        ,// 20  параметр для канала виброскорости
     3   ,"ПИК"                      ,        "пик"        ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0x82   ,        21        ,// 21  параметр для канала виброскорости
     3   ,"ПИК-ПИК"                  ,      "пик-пик"      ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0x82   ,        21        ,// 22  параметр для канала виброскорости
     3   ,"ПИК-Фактор"               ,    "пик-фактор"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   131   ,    1    ,  0x82   ,        21        ,// 23  параметр для канала виброскорости
//   3   ,"Спектр"                   ,      "спектр"       ,""              ,""        ,0          | O_SZ            | O_RW  ,   132   ,    1    ,  0x82   ,        21        ,// 24  параметр для канала виброскорости
     3   ,"ПИК"                      ,        "пик"        ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0x84   ,        22        ,// 24  параметр для канала виброперемещение
     3   ,"ПИК-ПИК"                  ,      "пик-пик"      ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0x84   ,        22        ,// 25  параметр для канала виброперемещение
     0   ,         " Сервис"         ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0xff   ,        4         ,// 26
     4   ,"Текущее время"            ,      "час:мин"      ,"Время"         ,""        ,0                            | O_RW  ,   18    ,    1    ,  0xff   ,        2         ,// 27
     4   ,"Регулировка точности"		 ,"часов, сек. в 30 дней","Регулировка" ,""        ,0                            | O_RW  ,   28    ,    1    ,  0xff   ,        32        ,// 		 
		 4   ,"Текущая дата"             ,      "чис:мес"      ,"Дата"          ,""        ,0                            | O_RW  ,   19    ,    1    ,  0xff   ,        1         ,// 28
     4   ,"Текущий год"              ,         ""          ,"Год"           ,""        ,0                            | O_RW  ,    0    ,    1    ,  0xff   ,        0         ,// 29     
     4   ,"Номер датчика"            ,  "DV-2"   					 ,"Номер DV"    ,""          ,0                      						   ,    0    ,    1    ,  0x7F   ,        23        ,// 32		 
     4   ,"Версия программного"      ,    "обеспечения"    ,"Версия ПО"     ,""        ,0                                    ,    2    ,    1    ,  0xff   ,        13        ,// 33
     4   ,"Форматировать"            ,         ""          ,""              ,""        ,0                            | O_RW  ,   10    ,    1    ,  0xff   ,        1         ,// 34
     4   ,"Наработка"                ,   "прибора, ч."     ,"Наработка"     ,""        ,0                                    ,    0    ,    1    ,  0xff   ,        14        ,// 36
		 4   ,"Калибровка батареи"       ,         ""          ,""              ,""        ,0                            | O_RW  ,   0xfe  ,    1    ,  0xC7   ,        0xfd        ,// 		 
		 4   ,"Автоотключение"  				 ,   "через 10 мин." 	 ,"Автоотключение",""        ,0                            | O_RW  ,    26   ,    0    ,  0xff   ,        30        ,		 
		 4   ,"Сброс настроек"           ,         ""          ,""              ,""        ,0                            | O_RW  ,   10    ,    1    ,  0xff   ,        0x63	    ,
     0   ," Выбор маршрута"          ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0x78   ,        5         ,// 37
		 5   ,"Маршрут"         				 ,         ""          ,       ""       ,    ""    ,0                                    ,  130    ,    0    ,  0xff   ,        0xff      ,// 38
		 5   ,"Маршрут Удаление"         ,         ""          ,       ""       ,    ""    ,0                                    ,  18     ,    2    ,  0xff   ,        0xfe      ,// 39		
		 0   ,         " Настройки"      ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0x80   ,        6         ,// 
		 6   ,"Текущая емкость"  				 ,   "АКБ, А/ч"        ,"Емкость"       ,""        ,0                            | O_RW  ,    26   ,    1    ,  0x80   ,        29        ,
		 6   ,"Номер датчика"            ,  "DV-2"   					 ,"Номер DV"      ,""        ,0          | O_SZ            | O_RW  ,    0    ,    1    ,  0x80   ,        23        ,// 31
		 6   ,"Коррекция"                ,  "виброускорения"   ,"Коррекция"     ,""        ,0          | O_SZ            | O_RW  ,    3    ,    1    ,  0x80   ,        25        ,// 30
		 6   ,"Изменение емкости" 	     ,   "АКБ, А/ч"        ,"Изм.емкости"   ,""        ,0                            | O_RW  ,    27   ,    1    ,  0x80   ,        31        ,
		 

	0xff   ,"Работа по маршруту"        					 ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    1    ,  0xff   ,        0xf0      ,// 40	
///	0xff   ,"Изменить"         				 ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    1    ,  0xff   ,        0xf1      ,// 41	
	0xff   ,"Удалить"         				 ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    1    ,  0xff   ,        0xf2      ,// 42	
	
	  0xf0   ,"Создание"        				 ,         ""          ,       ""       ,    ""    ,0                                    ,  128   ,    1    ,  0xff   ,        0xfa       ,// 43	
		0xf2   ,"Удаление"        				 ,         ""          ,       ""       ,    ""    ,0                                    ,  129   ,    1    ,  0xff   ,        0xfc       ,// 45		
 
};
const TEnum_val Enum_val[COUNT_ENUM] = {
//№ группы         Значение                Расшифровка
    25   ,                          0,"разомк"             ,//               1
    25   ,                          1,"замк"               ,//               2
    26   ,                          0,"Откл"               ,//               3
    26   ,                          1,"Вкл"                ,//               4
		27   ,                          0,"0.6"                ,//               5
    27   ,                          1,"1.2"                ,//               6
	28	 ,													0,"0 с."									 ,
	28	 ,													1,"2 с."									 ,
	28	 ,													2,"5 с."									 ,
	28	 ,													3,"7 с."									 ,
	28	 ,													4,"10 с."									 ,
	28	 ,													5,"12 с."									 ,
	28	 ,													6,"15 с."									 ,
	28	 ,													7,"17 с."									 ,
	28	 ,													8,"20 с."									 ,
	28	 ,													9,"22 с."									 ,
	28	 ,													10,"25 с."									 ,
	28	 ,													11,"27 с."									 ,
	28	 ,													12,"30 с."									 ,
	28	 ,													13,"32 с."									 ,
	28	 ,													14,"35 с."									 ,
	28	 ,													15,"37 с."									 ,
	28	 ,													16,"40 с."									 ,
	28	 ,													17,"42 с."									 ,
	28	 ,													18,"44 с."									 ,
	28	 ,													19,"47 с."									 ,
	28	 ,													20,"49 с."									 ,
	28	 ,													21,"52 с."									 ,
	28	 ,													22,"54 с."									 ,
	28	 ,													23,"57 с."									 ,
	28	 ,													24,"59 с."									 ,
	28	 ,													25,"62 с."									 ,
	28	 ,													26,"64 с."									 ,
	28	 ,													27,"67 с."									 ,
	28	 ,													28,"69 с."									 ,
	28	 ,													29,"72 с."									 ,
	28	 ,													30,"74 с."									 ,
	28	 ,													31,"77 с."									 ,
	28	 ,													32,"79 с."									 ,
	28	 ,													33,"82 с."									 ,
	28	 ,													34,"84 с."									 ,
	28	 ,													35,"87 с."									 ,
	28	 ,													36,"89 с."									 ,
	28	 ,													37,"91 с."									 ,
	28	 ,													38,"94 с."									 ,
	28	 ,													39,"96 с."									 ,
	28	 ,													40,"99 с."									 ,
	28	 ,													41,"101 с."									 ,
	28	 ,													42,"104 с."									 ,
	28	 ,													43,"106 с."									 ,
	28	 ,													44,"109 с."									 ,
	28	 ,													45,"111 с."									 ,
	28	 ,													46,"114 с."									 ,
	28	 ,													47,"116 с."									 ,
	28	 ,													48,"119 с."									 ,
	28	 ,													49,"121 с."									 ,
	28	 ,													50,"124 с."									 ,
	28	 ,													51,"126 с."									 ,
	28	 ,													52,"129 с."									 ,
	28	 ,													53,"131 с."									 ,
	28	 ,													54,"133 с."									 ,
	28	 ,													55,"136 с."									 ,
	28	 ,													56,"138 с."									 ,
	28	 ,													57,"141 с."									 ,
	28	 ,													58,"143 с."									 ,
	28	 ,													59,"146 с."									 ,
	28	 ,													60,"148 с."									 ,
	28	 ,													61,"151 с."									 ,
	28	 ,													62,"153 с."									 ,
	28	 ,													63,"156 с."									 ,
	28	 ,													64,"158 с."									 ,
	28	 ,													65,"161 с."									 ,
	28	 ,													66,"163 с."									 ,
	28	 ,													67,"166 с."									 ,
	28	 ,													68,"168 с."									 ,
	28	 ,													69,"171 с."									 ,
	28	 ,													70,"173 с."									 ,
	28	 ,													71,"176 с."									 ,
	28	 ,													72,"178 с."									 ,
	28	 ,													73,"180 с."									 ,
	28	 ,													74,"183 с."									 ,
	28	 ,													75,"185 с."									 ,
	28	 ,													76,"188 с."									 ,
	28	 ,													77,"190 с."									 ,
	28	 ,													78,"193 с."									 ,
	28	 ,													79,"195 с."									 ,
	28	 ,													80,"198 с."									 ,
	28	 ,													81,"200 с."									 ,
	28	 ,													82,"203 с."									 ,
	28	 ,													83,"205 с."									 ,
	28	 ,													84,"208 с."									 ,
	28	 ,													85,"210 с."									 ,
	28	 ,													86,"213 с."									 ,
	28	 ,													87,"215 с."									 ,
	28	 ,													88,"218 с."									 ,
	28	 ,													89,"220 с."									 ,
	28	 ,													90,"222 с."									 ,
	28	 ,													91,"225 с."									 ,
	28	 ,													92,"227 с."									 ,
	28	 ,													93,"230 с."									 ,
	28	 ,													94,"232 с."									 ,
	28	 ,													95,"235 с."									 ,
	28	 ,													96,"237 с."									 ,
	28	 ,													97,"240 с."									 ,
	28	 ,													98,"242 с."									 ,
	28	 ,													99,"245 с."									 ,
	28	 ,													100,"247 с."									 ,
	28	 ,													101,"250 с."									 ,
	28	 ,													102,"252 с."									 ,
	28	 ,													103,"255 с."									 ,
	28	 ,													104,"257 с."									 ,
	28	 ,													105,"260 с."									 ,
	28	 ,													106,"262 с."									 ,
	28	 ,													107,"264 с."									 ,
	28	 ,													108,"267 с."									 ,
	28	 ,													109,"269 с."									 ,
	28	 ,													110,"272 с."									 ,
	28	 ,													111,"274 с."									 ,
	28	 ,													112,"277 с."									 ,
	28	 ,													113,"279 с."									 ,
	28	 ,													114,"282 с."									 ,
	28	 ,													115,"284 с."									 ,
	28	 ,													116,"287 с."									 ,
	28	 ,													117,"289 с."									 ,
	28	 ,													118,"292 с."									 ,
	28	 ,													119,"294 с."									 ,
	28	 ,													120,"297 с."									 ,
	28	 ,													121,"299 с."									 ,
	28	 ,													122,"302 с."									 ,
	28	 ,													123,"304 с."									 ,
	28	 ,													124,"307 с."									 ,
	28	 ,													125,"309 с."									 ,
	28	 ,													126,"311 с."									 ,
	28	 ,													127,"314 с."									 ,	
	
};
