#include <Items.h>
//                                                                                       | O_LEFT  | O_SZ   | O_HR   | O_RW                                                           //коментарий
const TItem Items[MAX_ITEMS] = {
//№ группы     Текст в строке 0         Текст в строке 1    Сокр.коментарий   Ед.измер  Опиции                                Тип/ФорматУр.доступа  Маска   Ном.группы/адрес ре//
//                                                                                         вырав    нули    тип рег  запись                                                    //
                                                                                                                                                                               //
     0   ,       " Измерение"        ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0xFF   ,        1         ,//  0
     1   ,"Ускорение"                ,         ""          ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0xff   ,        16        ,//  1
     1   ,"Скорость"                 ,         ""          ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0xff   ,        16        ,//  2
     1   ,"Перемещение"              ,         ""          ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0xff   ,        16        ,//  3
     1   ,"Выборка сигнала"          ,         ""          ,""              ,""        ,0          | O_SZ            | O_RW  ,   131   ,    1    ,  0xff   ,        16        ,//  4
     0   ,   " Частотный диапазон"   ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0x87   ,        2         ,//  5
     2   ," 5-1000  Гц"              ,     "5-1000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0x81   ,        17        ,//  6  параметр для канала виброускорения
     2   ,"10-1000  Гц"              ,    "10-1000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0x81   ,        17        ,//  7  параметр для канала виброускорения
     2   ,"10-2000  Гц"              ,    "10-2000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0x81   ,        17        ,//  8  параметр для канала виброускорения
     2   ,"10-5000  Гц"              ,    "10-5000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   131   ,    1    ,  0x81   ,        17        ,// 9  параметр для канала виброускорения
//   2   ,"10-10000 Гц"              ,    "10-10000 Гц"    ,""              ,""        ,0          | O_SZ            | O_RW  ,   132   ,    1    ,  0x81   ,        17        ,// 10  параметр для канала виброускорения
     2   ," 5-1000  Гц"              ,     "5-1000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0x82   ,        18        ,// 10  параметр для канала виброскорости
     2   ,"10-1000  Гц"              ,    "10-1000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0x82   ,        18        ,// 11  параметр для канала виброскорости
     2   ,"10-2000  Гц"              ,    "10-2000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0x82   ,        18        ,// 12  параметр для канала виброскорости
     2   ,"10-5000  Гц"              ,    "10-5000 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   131   ,    1    ,  0x82   ,        18        ,// 13  параметр для канала виброскорости
     2   ,"10-300  Гц"               ,     "10-300 Гц"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0x84   ,        19        ,// 14  параметр для канала виброперемещение
     0   ,     " Режим/Детектор"     ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0x87   ,        3         ,// 15
     3   ,"СКЗ"                      ,        "скз"        ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0x81   ,        20        ,// 16  параметр для канала виброускорения
     3   ,"ПИК"                      ,        "пик"        ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0x81   ,        20        ,// 17  параметр для канала виброускорения
     3   ,"ПИК-ПИК"                  ,      "пик-пик"      ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0x81   ,        20        ,// 18  параметр для канала виброускорения
     3   ,"ПИК-Фактор"               ,    "пик-фактор"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   131   ,    1    ,  0x81   ,        20        ,// 19  параметр для канала виброускорения
//   3   ,"Спектр"                   ,      "спектр"       ,""              ,""        ,0          | O_SZ            | O_RW  ,   132   ,    1    ,  0x81   ,        20        ,// 20  параметр для канала виброускорения
     3   ,"СКЗ"                      ,        "скз"        ,""              ,""        ,0          | O_SZ            | O_RW  ,   128   ,    1    ,  0x82   ,        21        ,// 20  параметр для канала виброскорости
     3   ,"ПИК"                      ,        "пик"        ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0x82   ,        21        ,// 21  параметр для канала виброскорости
     3   ,"ПИК-ПИК"                  ,      "пик-пик"      ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0x82   ,        21        ,// 22  параметр для канала виброскорости
     3   ,"ПИК-Фактор"               ,    "пик-фактор"     ,""              ,""        ,0          | O_SZ            | O_RW  ,   131   ,    1    ,  0x82   ,        21        ,// 23  параметр для канала виброскорости
//   3   ,"Спектр"                   ,      "спектр"       ,""              ,""        ,0          | O_SZ            | O_RW  ,   132   ,    1    ,  0x82   ,        21        ,// 24  параметр для канала виброскорости
     3   ,"ПИК"                      ,        "пик"        ,""              ,""        ,0          | O_SZ            | O_RW  ,   129   ,    1    ,  0x84   ,        22        ,// 24  параметр для канала виброперемещение
     3   ,"ПИК-ПИК"                  ,      "пик-пик"      ,""              ,""        ,0          | O_SZ            | O_RW  ,   130   ,    1    ,  0x84   ,        22        ,// 25  параметр для канала виброперемещение
     0   ,         " Сервис"         ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0xff   ,        4         ,// 26
     4   ,"Текущее время"            ,      "час:мин"      ,"Время"         ,""        ,0                            | O_RW  ,   18    ,    1    ,  0xff   ,        2         ,// 27
     4   ,"Текущая дата"             ,      "чис:мес"      ,"Дата"          ,""        ,0                            | O_RW  ,   19    ,    1    ,  0xff   ,        1         ,// 28
     4   ,"Текущий год"              ,         ""          ,"Год"           ,""        ,0                            | O_RW  ,    0    ,    1    ,  0xff   ,        0         ,// 29
     4   ,"Коррекция"                ,  "виброускорения"   ,"Коррекция"     ,""        ,0          | O_SZ            | O_RW  ,    3    ,    1    ,  0x80   ,        25        ,// 30
     4   ,"Номер датчика"            ,  "DV-2"   					 ,"Номер DV"    ,""          ,0          | O_SZ            | O_RW  ,    0    ,    1    ,  0x80   ,        23        ,// 31
     4   ,"Номер датчика"            ,  "DV-2"   					 ,"Номер DV"    ,""          ,0                      						   ,    0    ,    1    ,  0x7F   ,        23        ,// 32		 
     4   ,"Версия программного"      ,    "обеспечения"    ,"Версия ПО"     ,""        ,0                                    ,    2    ,    1    ,  0xff   ,        13        ,// 33
     4   ,"Форматировать"            ,         ""          ,""              ,""        ,0                            | O_RW  ,   10    ,    1    ,  0xff   ,        1         ,// 34
///		 4   ,"Удаление маршрутов"       ,         ""          ,""              ,""        ,0                                    ,   0xfe  ,    1    ,  0xff   ,        6         ,// 35
     4   ,"Наработка"                ,   "прибора, ч."     ,"Наработка"     ,""        ,0                                    ,    0    ,    1    ,  0xff   ,        14        ,// 36
		 4   ,"Калибровка батареи"       ,         ""          ,""              ,""        ,0                            | O_RW  ,   0xfe  ,    1    ,  0xff   ,        0xfd        ,// 
		 4   ,"Текущая емкость"  				 ,   "АКБ, А/ч"        ,"Емкость"       ,""        ,0                            | O_RW  ,    26   ,    1    ,  0x80   ,        29        ,
		 4   ,"Автоотключение"  				 ,   "через 10 мин." 	 ,"Автооткл."     ,""        ,0                            | O_RW  ,    26   ,    1    ,  0xff   ,        30        ,
     0   ," Выбор маршрута"          ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    0    ,  0x78   ,        5         ,// 37
		 5   ,"Маршрут"         				 ,         ""          ,       ""       ,    ""    ,0                                    ,  130    ,    0    ,  0xff   ,        0xff      ,// 38
		 5   ,"Маршрут Удаление"         ,         ""          ,       ""       ,    ""    ,0                                    ,  18     ,    2    ,  0xff   ,        0xfe      ,// 39		

	0xff   ,"Создать"        					 ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    1    ,  0xff   ,        0xf0      ,// 40	
///	0xff   ,"Изменить"         				 ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    1    ,  0xff   ,        0xf1      ,// 41	
	0xff   ,"Удалить"         				 ,         ""          ,       ""       ,    ""    ,0                                    ,  0xfe   ,    1    ,  0xff   ,        0xf2      ,// 42	
	
	0xf0   ,"Создание"        				 ,         ""          ,       ""       ,    ""    ,0                                    ,  128   ,    1    ,  0xff   ,        0xfa       ,// 43	
///	0xf1   ,"Изменение"        				 ,         ""          ,       ""       ,    ""    ,0                                    ,  129   ,    1    ,  0xff   ,        0xfb       ,// 44		
//	0xf2   ,"Удаление"        				 ,         ""          ,       ""       ,    ""    ,0                                    ,  129   ,    1    ,  0xff   ,        0xfc       ,// 45		
		0xf2   ,"Удаление"        				 ,         ""          ,       ""       ,    ""    ,0                                    ,  129   ,    1    ,  0xff   ,        0xfc       ,// 45		
 
};
const TEnum_val Enum_val[COUNT_ENUM] = {
//№ группы         Значение                Расшифровка
    25   ,                          0,"разомк"             ,//               1
    25   ,                          1,"замк"               ,//               2
    26   ,                          0,"Откл"               ,//               3
    26   ,                          1,"Вкл"                ,//               4
};
